IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC4_CFG_CONTROLSS_ADC4_CFG.xml
	<register id="CONTROLSS_ADC4_CFG_ADCSOCOVFCLR1" acronym="CONTROLSS_ADC4_CFG_ADCSOCOVFCLR1" offset="0x1E" width="16" description="">
		<bitfield id="SOC15" width="1" begin="15" end="15" resetval="0x0" description="SOC15 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC15 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC15 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC14" width="1" begin="14" end="14" resetval="0x0" description="SOC14 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC14 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC14 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="14" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC13" width="1" begin="13" end="13" resetval="0x0" description="SOC13 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC13 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC13 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="13" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC12" width="1" begin="12" end="12" resetval="0x0" description="SOC12 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC12 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC12 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC11" width="1" begin="11" end="11" resetval="0x0" description="SOC11 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC11 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC11 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC10" width="1" begin="10" end="10" resetval="0x0" description="SOC10 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC10 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC10 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC9" width="1" begin="9" end="9" resetval="0x0" description="SOC9 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC9 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC9 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC8" width="1" begin="8" end="8" resetval="0x0" description="SOC8 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC8 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC8 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC7" width="1" begin="7" end="7" resetval="0x0" description="SOC7 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC7 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC7 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC6" width="1" begin="6" end="6" resetval="0x0" description="SOC6 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC6 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC6 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC5" width="1" begin="5" end="5" resetval="0x0" description="SOC5 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC5 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC5 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC4" width="1" begin="4" end="4" resetval="0x0" description="SOC4 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC4 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC4 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC3" width="1" begin="3" end="3" resetval="0x0" description="SOC3 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC3 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC3 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC2" width="1" begin="2" end="2" resetval="0x0" description="SOC2 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC2 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC2 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC1" width="1" begin="1" end="1" resetval="0x0" description="SOC1 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC1 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC1 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC0" width="1" begin="0" end="0" resetval="0x0" description="SOC0 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC0 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC0 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
